#include <stdio.h>

int main()
{
    char input;
choice:
    printf("Запустити код? (y/n): ");
    scanf(" %c", &input);
    if (input == 'y')
    {
        goto code;
    }
    else if (input == 'n')
    {
        printf("Код зупинено.");
        return 0;
    }
    else
    {
        printf("Невірний вибір, введіть ще раз.\n");
        goto choice;
    }

code:
{
  int n;
    printf("Введіть кількість елементів масиву: "); // Ввід кількості елементів масиву
    scanf("%d", &n); // Зчитування кількості елементів 

    int a[n];
    printf("Введіть елементи масиву:\n");
    for (int i = 0; i < n; i++) {
        printf("a[%d] = ", i); // Ввід елементів масиву
        scanf("%d", &a[i]); // Зчитування елементів масиву 
    }

    int x, b;
    printf("Введіть значення x: "); // Ввід значення x
    scanf("%d", &x); // Зчитування значення x 
    printf("Введіть значення b: "); // Ввід значення b
    scanf("%d", &b); // Зчитування значення b
    // Перевірка кількості елементів у відрізку [x, b]
    int count = 0;
    for (int i = 0; i < n; i++) {
        if (a[i] >= x && a[i] <= b) { // Перевірка, чи елемент масиву знаходиться у відрізку [x, b]
            count++; // Збільшення лічильника, якщо елемент знаходиться у відрізку
        } else if (a[i] <= x && a[i] >= b) {
            printf("Не відповідає умові x < n, b > n, x < b.");
            goto choice;
        }
    }

    printf("Кількість елементів масиву, які знаходяться в межах відрізка [%d, %d]: %d\n", x, b, count); // Виведення результату

    goto choice;
}
}
